# Foundations of Computer Science Project
### Kiva Dataset
Paolo Mariani
<br>Matricola 800307

#### Import all required libraries

In [16]:
import pandas as pd
import re
import datetime as dt

#### Import all required Datasets

In [17]:
loan_lenders = pd.read_csv("kiva/loans_lenders.csv")
loan_lenders.head()

   loan_id                                            lenders
0   483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1   483738  muc888, nora3555, williammanashi, barbara5610,...
2   485000  muc888, terrystl, richardandsusan8352, sherri4...
3   486087  muc888, james5068, rudi5955, daniel9859, don92...
4   534428  muc888, niki3008, teresa9174, mike4896, david7...

In [18]:
loans = pd.read_csv("kiva/loans.csv")
loans.head()

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,...,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,...,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,...,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,...,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,...,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,...,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner

In [25]:
lenders = pd.read_csv("kiva/lenders.csv")
lenders.head()

,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited
0,qian3013,Qian,NaN,NaN,NaN,1461300457,NaN,NaN,1.0,NaN,0
1,reena6733,Reena,NaN,NaN,NaN,1461300634,NaN,NaN,9.0,NaN,0
2,mai5982,Mai,NaN,NaN,NaN,1461300853,NaN,NaN,NaN,NaN,0
3,andrew86079135,Andrew,NaN,NaN,NaN,1461301091,NaN,NaN,5.0,Peter Tan,0
4,nguyen6962,Nguyen,NaN,NaN,NaN,1461301154,NaN,NaN,NaN,NaN,0

### 1) Normalize the loan_lenders table. In the normalized table, each row must have one loan_id and one lender

The Dataset must be normalized, in each value of the column "lenders" there's a list of users which has to be normalized and split in different rows (one for each user).

In [19]:
lenders_list = loan_lenders["lenders"].str.split(",").explode()
lenders_list.head()

0          muc888
0         sam4326
0     camaran3922
0     lachheb1865
0     rebecca3499
Name: lenders, dtype: object

In [20]:
loan_lenders_norm = pd.merge(loan_lenders, lenders_list, left_index=True, right_index=True)
loan_lenders_norm

,loan_id,lenders_x,lenders_y
0,483693,"muc888, sam4326, camaran3922, lachheb1865, reb...",muc888
0,483693,"muc888, sam4326, camaran3922, lachheb1865, reb...",sam4326
0,483693,"muc888, sam4326, camaran3922, lachheb1865, reb...",camaran3922
0,483693,"muc888, sam4326, camaran3922, lachheb1865, reb...",lachheb1865
0,483693,"muc888, sam4326, camaran3922, lachheb1865, reb...",rebecca3499
...,...,...,...
1387430,1206425,"rich6705, sergiiy9766, angela7509, barbara5610...",trogdorfamily7622
1387430,1206425,"rich6705, sergiiy9766, angela7509, barbara5610...",danny6470
1387430,1206425,"rich6705, sergiiy9766, angela7509, barbara5610...",don6118
1387431,1206486,"alan5175, amy38101311",alan5175
1387431,1206486,"alan5175, amy38101311",amy38101311

To verify the normalization i do print the size of the list for the first row (index 0) and after i print the number of rows that are obtained with index 0.

In [21]:
len(loan_lenders.loc[0, "lenders"].split(","))

40

In [22]:
loan_lenders_norm.groupby(loan_lenders_norm.index).count().head()

   loan_id  lenders_x  lenders_y
0       40         40         40
1       15         15         15
2       15         15         15
3       13         13         13
4       19         19         19

Then the column "lenders_x" is deleted and "lenders_y" becomes "lender":

In [23]:
loan_lenders_norm.drop("lenders_x", axis = 1, inplace = True)
loan_lenders_norm.rename({"lenders_y": "lender"}, axis = 1, inplace = True)
loan_lenders_norm.reset_index(inplace = True)
loan_lenders_norm.head()

   index  loan_id        lender
0      0   483693        muc888
1      0   483693       sam4326
2      0   483693   camaran3922
3      0   483693   lachheb1865
4      0   483693   rebecca3499

### 2) For each loan, add a column duration corresponding to the number of days between the disburse time and the planned expiration time. If any of those two dates is missing, also the duration must be missing

In [9]:
loans[["loan_id", "loan_name", "planned_expiration_time", "disburse_time"]]

,loan_id,loan_name,planned_expiration_time,disburse_time
0,657307,Aivy,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000
1,657259,Idalia Marizza,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000
2,658010,Aasia,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000
3,659347,Gulmira,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000
4,656933,Ricky\t,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000
...,...,...,...,...
1419602,988180,NaN,2016-01-02 01:00:03.000 +0000,2015-11-23 08:00:00.000 +0000
1419603,988213,Perlita,2016-01-02 16:40:07.000 +0000,2015-11-24 08:00:00.000 +0000
1419604,989109,Okyeso Nyame Group,2016-01-03 22:20:04.000 +0000,2015-11-13 08:00:00.000 +0000
1419605,989143,Exequila,2016-01-05 08:50:02.000 +0000,2015-11-03 08:00:00.000 +0000
1419606,989240,Lydia,2016-01-03 20:50:06.000 +0000,2015-11-03 08:00:00.000 +0000

The duration attribute is computed with a simple difference between "planned_expiration_time" and "disburse_time" in datetime format. All the values of these attributes that are missing automatically set the "duration" attribute as None.

In [10]:
loans["planned_expiration_time"] = pd.to_datetime(loans["planned_expiration_time"])
loans["disburse_time"] = pd.to_datetime(loans["disburse_time"])

In [11]:
loans["duration"] = loans["planned_expiration_time"] - loans["disburse_time"]
loans[loans["planned_expiration_time"].isnull()]["duration"] == None
loans[loans["disburse_time"].isnull()]["duration"] == None
print(len(loans[loans.duration.isnull()]))
loans.duration.head()

374645

0   53 days 19:30:06
1   96 days 14:25:07
2   37 days 13:10:05
3   34 days 19:10:02
4   57 days 22:10:02
Name: duration, dtype: timedelta64[ns]

There are currently 374645 missing values and the "duration" feature must be expressed only in days:

In [12]:
loans["duration"] = loans["duration"].apply(lambda x: x.days if x!= None else None)
loans["duration"]

0          53.0
1          96.0
2          37.0
3          34.0
4          57.0
           ...
1419602    39.0
1419603    39.0
1419604    51.0
1419605    63.0
1419606    61.0
Name: duration, Length: 1419607, dtype: float64

In [13]:
len(loans[loans.planned_expiration_time<loans.disburse_time])

14935

There are also 14935 values where the duration time is negative

### 3) Find the lenders that have funded at least twice

In [26]:
lenders.head()

,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited
0,qian3013,Qian,NaN,NaN,NaN,1461300457,NaN,NaN,1.0,NaN,0
1,reena6733,Reena,NaN,NaN,NaN,1461300634,NaN,NaN,9.0,NaN,0
2,mai5982,Mai,NaN,NaN,NaN,1461300853,NaN,NaN,NaN,NaN,0
3,andrew86079135,Andrew,NaN,NaN,NaN,1461301091,NaN,NaN,5.0,Peter Tan,0
4,nguyen6962,Nguyen,NaN,NaN,NaN,1461301154,NaN,NaN,NaN,NaN,0

In [30]:
loan_lenders_norm.head()

   index  loan_id        lender
0      0   483693        muc888
1      0   483693       sam4326
2      0   483693   camaran3922
3      0   483693   lachheb1865
4      0   483693   rebecca3499

In [32]:
lenders_funds = pd.merge(loan_lenders_norm, lenders, left_on="lender", right_on="permanent_name")
lenders_funds.head()

,index,loan_id,lender,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited
0,0,483693,muc888,muc888,MUC888,SF Bay Area,CA,US,1292745962,NaN,entrepreneurs advance mankind.,904.0,NaN,0
1,1,483738,muc888,muc888,MUC888,SF Bay Area,CA,US,1292745962,NaN,entrepreneurs advance mankind.,904.0,NaN,0
2,2,485000,muc888,muc888,MUC888,SF Bay Area,CA,US,1292745962,NaN,entrepreneurs advance mankind.,904.0,NaN,0
3,3,486087,muc888,muc888,MUC888,SF Bay Area,CA,US,1292745962,NaN,entrepreneurs advance mankind.,904.0,NaN,0
4,4,534428,muc888,muc888,MUC888,SF Bay Area,CA,US,1292745962,NaN,entrepreneurs advance mankind.,904.0,NaN,0